{
  "9": {
    "milestone": "Your baby is starting to figure out that people and things don't just vanish when they leave the room. You'll see this when they look for a toy you hid under a blanket, or when they get upset that grandma walked out the door. They're also pulling up on furniture now, and those little legs are getting stronger every day. All that babbling? It's not random. They're practicing the sounds they hear you make.",
    "watchout": "Now that your baby can pick up tiny things between their thumb and finger, the floor is basically a buffet of choking hazards. Do a quick sweep every day for anything smaller than a toilet paper roll. They're also pulling up on everything, so double-check that heavy furniture is anchored to the wall. Tablecloths are tempting grab targets, and whatever is on the table comes crashing down with them.",
    "cheerup": "Nine months in and you've kept a whole human alive and thriving. Some days feel like you're barely holding it together, and that's okay. Your baby doesn't need perfect. They need you, and you're already exactly what they need."
  },
  "10": {
    "milestone": "Peek-a-boo is about to become your baby's favorite game, and they'll want to play it roughly four hundred times in a row. They respond to their name now, which is a big deal. Watch for little gestures too, like reaching up to be held or pushing food away when they're done. Crawling is getting fast, and that pincer grasp means they can pick up a single Cheerio with real precision.",
    "watchout": "If you have stairs, now is the time for gates at the top and bottom. Your baby is mobile and curious, and that combination is relentless. Cover electrical outlets, because those little fingers are exploring every hole and gap they can find. Separation anxiety is also peaking right now, so daycare drop-offs might be rough for a bit.",
    "cheerup": "You're learning your baby's personality now, the real one. The way they light up during peek-a-boo, the way they reach for you specifically. That bond you've been building? It's showing."
  },
  "11": {
    "milestone": "Your baby's babbling is starting to sound like actual conversation. They'll string sounds together with the right rhythm and tone, and you'll swear they just said a full sentence. Pat-a-cake and other clapping games are a hit because your baby loves imitating you. They're also cruising along furniture now, shuffling sideways while holding on, building toward those first independent steps.",
    "watchout": "Cabinet and drawer locks are your friend this month. Your baby can open things now and will put whatever they find straight into their mouth. Don't stress about when walking happens. Some babies walk at 9 months, some at 15. Both are completely normal. Bath time needs close attention, because a baby can slip under water in seconds, even in just a few inches.",
    "cheerup": "Almost a year. Think about where you were eleven months ago and where you are now. You've changed as much as your baby has, even if it doesn't feel that way."
  },
  "12": {
    "milestone": "Happy birthday to your baby. They might be saying \"mama\" or \"dada\" and actually meaning the right person now. First steps could happen this month, or they might wait a bit, and either timeline is fine. They're figuring out how objects work, like holding a phone to their ear or pushing a toy car along the floor. They can also find things you've hidden, which means hiding the TV remote just got harder.",
    "watchout": "Your pediatrician will likely recommend switching from formula or breast milk to whole milk around now. Go slow with the transition. If your baby is walking, expect some tumbles and head bumps. Keep sharp corners padded. The transition from bottle to cup takes time and patience, so don't expect it to happen overnight.",
    "cheerup": "You made it through the first year. That's not a small thing. Whatever this year threw at you, you handled it, and your baby is proof."
  },
  "13": {
    "milestone": "Your toddler is getting affectionate on purpose now. Those hugs and sloppy kisses aren't accidental. Simple pretend play is starting, like feeding a stuffed animal or talking into a toy phone. They probably have one to three words they use consistently. Pointing is becoming a big communication tool, and they're fascinated by putting things into containers and dumping them out again.",
    "watchout": "Picky eating often starts around now. Your toddler might refuse foods they loved last week. This is normal and not a battle worth fighting hard. They're also climbing on furniture more, so make sure bookshelves and dressers are secured to the wall. A tipped dresser is one of the most dangerous household hazards for toddlers.",
    "cheerup": "Toddlerhood is a whole new game. It's louder and messier, but those little arms reaching up for a hug make all of it worth it."
  },
  "14": {
    "milestone": "Your toddler wants an audience. They'll do something silly, look at you, and wait for your reaction. They love being the center of attention. If they're around other kids, they'll start copying what those kids do. They understand way more words than they can say, so keep talking to them about everything. Stacking two blocks is a new skill, and walking is getting steadier each day.",
    "watchout": "Check your windows and balcony doors. Your toddler can push chairs over to climb, and they will. If they're not saying any words yet, mention it at the next pediatrician visit. Most of the time it's nothing to worry about, but early intervention for speech is really effective when it is needed.",
    "cheerup": "Watching your kid imitate the world around them is one of the best parts of this age. You'll catch them doing something you do, and it'll stop you in your tracks."
  },
  "15": {
    "milestone": "Your toddler is a little copycat now, and they learn a lot by watching other children. They'll bring you things to show you, which is their way of sharing their world with you. They might have three or more words. Following simple directions like \"bring me the ball\" is clicking. Walking alone is either happening or very close, and every step is a tiny act of bravery.",
    "watchout": "The 15-month well-child visit is due, so schedule it if you haven't. Tantrums may be starting, and they're the result of big emotions in a small person who can't express them yet. Start brushing those little teeth twice a day if you aren't already. Baby toothpaste with fluoride in a rice-grain-sized amount is the current recommendation.",
    "cheerup": "Parenting a toddler is exhausting in a completely different way than parenting an infant. But you're figuring it out. You always do."
  },
  "16": {
    "milestone": "Your toddler hugs their stuffed animals now, which is unbearably sweet. They're starting to help with getting dressed, like pushing their arm through a sleeve or pulling off a sock. Their vocabulary is around five to ten words, and they can point to body parts when you ask. Stacking three blocks is the new achievement. Walking is solid enough that they're getting into everything with confidence.",
    "watchout": "The kitchen is especially dangerous right now. Hot stove handles, boiling pots, and sharp objects are all within potential reach as climbing improves. Screen time for toddlers under 18 months should be minimal, mostly video calls with family. Their brains learn best from real-world interaction at this age.",
    "cheerup": "That moment when your toddler hugs a stuffed bear and pats its back? They learned that gentleness from you. You're doing more right than you realize."
  },
  "17": {
    "milestone": "\"Mine\" is becoming a favorite word, and that's actually healthy. Your toddler is learning they're a separate person with their own things. Parallel play is happening, where they play next to other kids but not really with them yet. They're combining gestures with words, like pointing at the fridge and saying \"milk.\" Climbing on furniture is a daily hobby now, and they can scribble with a crayon if you give them one.",
    "watchout": "If your toddler can climb out of their crib, it's time to lower the mattress to the lowest setting or consider a toddler bed. They're also in a throwing phase. Everything is a projectile. Keep hard objects out of reach, and redirect them to soft balls when the throwing urge hits.",
    "cheerup": "The word \"mine\" might drive you a little crazy, but it means your toddler has a sense of self. That's a real milestone, even when it's inconvenient."
  },
  "18": {
    "milestone": "Welcome to the age of big feelings. Tantrums are normal right now because your toddler has strong opinions and almost no ability to express them calmly. Pretend play is expanding. They might stir a pot with a spoon or pretend to feed you. They're saying at least three words beyond mama and dada, and they follow simple verbal instructions well. This is a busy, loud, wonderful stage.",
    "watchout": "The 18-month visit often includes a developmental screening, and your pediatrician may ask about autism-related milestones. This is routine and not cause for alarm. Biting and hitting sometimes show up around now, usually out of frustration. Stay calm, say \"no biting\" firmly, and redirect. Check that your car seat is still installed correctly and the right size.",
    "cheerup": "Tantrums are hard on everyone. But when they pass, your toddler comes back to you for comfort. You're their safe place. That means everything."
  },
  "19": {
    "milestone": "Your toddler is trying to run, and it looks more like a controlled stumble, but they're committed. Vocabulary is picking up speed now. You'll notice new words appearing almost daily. When you read books together, they'll point at pictures and want you to name things. They're also trying to use a spoon by themselves, which is messy and slow and exactly how they learn.",
    "watchout": "Running means running toward danger, like streets and parking lots. Hold hands near roads every single time, even if they protest. Sleep regression can hit around now, so if bedtime suddenly falls apart, stay consistent with your routine. It usually passes within a few weeks.",
    "cheerup": "The mess at mealtime when they try the spoon themselves? That's independence growing. Wipe the floor later. Right now, let them try."
  },
  "20": {
    "milestone": "Your toddler is starting to notice that things come in different shapes and colors. Sorting toys and simple puzzles are getting interesting. \"No\" is a word they use constantly, and they mean it every time. They can kick a ball now, which makes backyard time more fun. Building with blocks is getting more deliberate, less random stacking and more intentional structures.",
    "watchout": "Water safety is critical. Toddlers can drown in just two inches of water, so never leave them alone near a bathtub, bucket, or pool, even for a moment. All the defiance right now is developmental. They're testing boundaries because that's literally their job at this age. Stay firm but don't take it personally.",
    "cheerup": "Hearing \"no\" all day is draining. But your toddler is learning to assert themselves, and that's a skill that will serve them well their whole life."
  },
  "21": {
    "milestone": "Your toddler can follow two-step instructions now, like \"pick up the ball and bring it to me.\" That's a real cognitive leap. Pretend play is getting richer. You might see them set up a tea party or pretend to cook. Two-word phrases are emerging, and running is smoother. They're becoming a real little person with opinions about everything from socks to snacks.",
    "watchout": "Playground equipment is exciting but risky. Stay within arm's reach on anything elevated. Tooth brushing battles are common at this age. Try letting them brush first, then you do a quick follow-up. Making it a game helps more than making it a fight.",
    "cheerup": "Those two-word phrases are the beginning of real conversation. Soon you'll hear what they're actually thinking, and it's going to be hilarious."
  },
  "22": {
    "milestone": "Your toddler can name things in books now, not just point at them. \"Dog!\" \"Ball!\" \"Baby!\" Pretend play is getting more complex, with sequences like feeding a doll and then putting it to bed. Vocabulary is growing fast, sometimes a few new words each week. They can kick a ball forward with purpose, not just accidentally bump into it.",
    "watchout": "Emotional outbursts are peaking around now. Full-body meltdowns in the grocery store are not a reflection of your parenting. Keep cleaning products, medications, and anything toxic locked up high. Toddlers are resourceful climbers, and poison control calls spike at this age.",
    "cheerup": "A grocery store meltdown feels like the whole world is watching. It's not. And the parents who are watching? They've been there. Every single one of them."
  },
  "23": {
    "milestone": "Two-step instructions are becoming second nature. \"Get your shoes and sit by the door\" actually works most of the time. Imagination is emerging in beautiful ways, with stories and scenarios your toddler invents from scratch. They're learning possessives, like \"mommy's phone\" and \"my cup.\" Throwing a ball overhand is a new physical skill that gets practiced often, whether you're ready or not.",
    "watchout": "Some kids show signs of potty training readiness around now, like telling you when their diaper is wet. Don't push it. Readiness varies a lot. Check your home for any cords or ropes within reach, like window blind cords. These are a strangulation hazard that's easy to overlook.",
    "cheerup": "Your toddler's imagination is coming alive. The stories they invent are wild and wonderful. Pull up a chair and play along."
  },
  "24": {
    "milestone": "Your child is two. Two-word sentences are common now, like \"more milk\" and \"daddy go.\" They're starting to play with other children, not just beside them. They can name lots of everyday objects and run without falling much. Kicking a ball is getting accurate. This is a child who knows what they want and is learning to tell you about it.",
    "watchout": "The 2-year well-child visit is important, so keep that appointment. If your child is still rear-facing in their car seat, that's actually safest for as long as they fit. Aggressive behavior with other kids, like pushing or grabbing, is normal at this age. They're learning social rules from zero, and it takes time.",
    "cheerup": "Two years. You've navigated sleepless nights, teething, tantrums, and about a thousand diaper changes. You're not the same parent you were at the start. You're better."
  },
  "25": {
    "milestone": "Pretend play is getting elaborate. Your toddler might run a whole restaurant out of their play kitchen. Their vocabulary is over 50 words, and they're starting to grasp the difference between \"mine\" and \"yours,\" even if sharing is still hard. Jumping with both feet off the ground is a new physical milestone. Watch for it, because they'll want you to see every single jump.",
    "watchout": "If you're transitioning to a toddler bed, keep the room safe. Anchor all furniture, cover outlets, and keep the floor clear at night. Sun safety matters for outdoor play. Toddler skin burns fast, so use sunscreen and hats even on cloudy days.",
    "cheerup": "Every jump they land, they look at you first. You're still the person whose reaction matters most. Hold onto that."
  },
  "26": {
    "milestone": "Your toddler is following stories in books now, not just looking at pictures. They're using pronouns like \"I\" and \"me\" and \"you,\" which shows real language growth. \"Why?\" is starting to appear, and once it starts, it doesn't stop. Climbing is confident and purposeful. They know where they want to go and they'll figure out how to get there.",
    "watchout": "Nightmares can begin around this age. They're brief and your child won't remember them well, but they can be upsetting in the moment. Comfort and reassure. Driveways and garages are dangerous. Always know where your toddler is before moving a car, and never assume they'll stay put.",
    "cheerup": "The \"why\" phase can be exhausting. But every question means your child trusts you to explain the world. That trust is something you built."
  },
  "27": {
    "milestone": "Your toddler has friends now, real ones whose names they say. Sorting by color or shape is clicking, and they're proud when they get it right. Sentences are getting longer, three words or more. Running and climbing are confident, and they tackle playground equipment that used to be too advanced. They're bigger in every way this month.",
    "watchout": "If you have pets, teach your toddler gentle touching and never leave them unsupervised together, no matter how calm the animal seems. Refusing vegetables is completely normal at this age. Keep offering them without pressure. It can take 15 or more exposures before a toddler accepts a new food.",
    "cheerup": "Your child has friends. They talk about them at home. You gave them the social confidence to connect with other people, and that started with you."
  },
  "28": {
    "milestone": "Pretend play now has sequences and storylines. The teddy bear gets sick, goes to the doctor, and then gets a bandage. Your toddler understands concepts like \"big\" and \"little\" and uses them correctly. Counting is starting, usually just to three. If there's a tricycle around, they might figure out the pedaling motion this month.",
    "watchout": "If your child has access to scissors, make sure they're the blunt-tipped kind and always supervised. Stuttering can appear around this age as your toddler's brain works faster than their mouth. It usually resolves on its own, but mention it to your pediatrician if it lasts more than six months.",
    "cheerup": "Their imagination is building entire worlds now. The stories they tell might not make sense to anyone else, but they make sense to them. Sit in that world with them when you can."
  },
  "29": {
    "milestone": "Imaginative play is really flourishing. Your child might have elaborate scenarios with characters and conversations. They know their first and last name and can tell you if you ask. Drawing is getting more intentional, with basic shapes and lines that mean something to them. Balancing on one foot, even for just a second, is a new skill they're working on.",
    "watchout": "Your child is running faster and climbing higher, which means falls are more dramatic. Keep a basic first aid kit handy. Imaginary fears are normal right now. Monsters under the bed, scary shadows, loud noises. Take their fears seriously, even when they seem silly to you. A quick \"monster check\" before bed goes a long way.",
    "cheerup": "They know their own name. First and last. They're becoming their own person, built on the foundation you gave them."
  },
  "30": {
    "milestone": "Make-believe with other children is happening now, not just solo pretend play. Your child uses short sentences routinely and understands spatial words like \"in,\" \"on,\" and \"under.\" They can catch a large ball if you toss it gently. This is an age where you can really see the person they're becoming, their humor, their preferences, their way of thinking.",
    "watchout": "The 30-month developmental check is a good time to bring up any concerns. Trust your instincts as a parent. Button batteries are extremely dangerous if swallowed. They can cause serious internal burns within two hours. Keep remotes, key fobs, and small electronics out of reach or secured.",
    "cheerup": "You can see their personality clearly now. The way they laugh, what makes them curious, how they comfort a friend. You helped shape all of that."
  },
  "31": {
    "milestone": "Taking turns in games is a new social skill, even if it needs a lot of reminding. Your child can answer simple questions like \"what's your name?\" and \"what does a cow say?\" Drawing circles and lines is getting easier, and they're proud of what they create. Hopping on one foot might happen this month, or they'll try it and fall over laughing.",
    "watchout": "If you're potty training, go at your child's pace. Pressure and punishment backfire. Celebrate successes and shrug off accidents. Keep all medications in child-proof containers and stored out of reach. Toddlers can open more types of containers than you'd expect.",
    "cheerup": "Potty training is a marathon, not a sprint. Every kid gets there eventually. Take a breath. You've got this, even on the messy days."
  },
  "32": {
    "milestone": "Cooperative play is starting to happen. Your child can play with another kid toward a shared goal, like building a tower together. They retell stories they know well, sometimes with their own creative additions. Counting to three is solid. Undressing themselves is easy now, and they'll prove it at the most inconvenient moments.",
    "watchout": "If a new sibling is arriving or has recently arrived, expect some jealousy and regression. This is normal and temporary. Give extra one-on-one time when you can. Your child's emotional world is getting more complex, and they need help naming their feelings. \"You seem frustrated\" goes further than \"stop crying.\"",
    "cheerup": "The fact that your child retells stories means they've been listening to you all along. Every book you read, every story you told, it landed."
  },
  "33": {
    "milestone": "Your child notices when another kid is upset and might try to comfort them. That's empathy, and it's real. Sentences are four to five words long now. They understand the concept of \"same\" and \"different,\" which makes simple matching games fun. Catching a bounced ball is a new coordination milestone.",
    "watchout": "If preschool is on the horizon, start talking about it positively and casually. Visit if you can. Choking is still a real risk at this age. Cut grapes and hot dogs lengthwise, and avoid hard round foods like whole nuts. It only takes a second.",
    "cheerup": "Your child comforted a crying friend. You didn't teach them a lesson about empathy. You showed them what it looks like, and they absorbed it."
  },
  "34": {
    "milestone": "Simple board games with help are possible now, and your child genuinely enjoys the structure. They can tell you about their day, not just what happened, but how they felt about it. Some letter recognition is happening, especially the first letter of their name. Walking up stairs with alternating feet, instead of one step at a time, shows real coordination growth.",
    "watchout": "Car safety is always worth reviewing. Make sure the car seat fits properly and that your child can't unbuckle themselves. At this age, kids sometimes play rough with each other. There's a difference between aggressive play and actual aggression. Watch for patterns, not isolated incidents.",
    "cheerup": "They told you about their day. What they did, what they felt. That conversation is something you'll have for the rest of your lives. It started here."
  },
  "35": {
    "milestone": "Cooperative play is more consistent now. Your child can play with others, share sometimes, and follow basic game rules. They tell simple stories with a beginning and something that happens. Counting to five or higher is clicking. Tricycle riding is getting smooth, with real steering and pedaling working together.",
    "watchout": "Be thoughtful about what your child sees on screens. At this age they absorb everything, and some content aimed at kids is more intense than it looks. Bathroom independence is growing, but don't leave a young child alone in the bathroom. Wet floors, toilet water, and faucet scalding are all real risks.",
    "cheerup": "They're telling stories now. Real ones. Some are true, some are made up, and some are somewhere in between. All of them are a window into how they see the world."
  },
  "36": {
    "milestone": "Your child is three. They play with other children, not just near them. Real conversations are happening, with back-and-forth exchanges that surprise you. They know their name and age and will tell anyone who asks. Running and jumping are confident and joyful. They can draw a person with a head and maybe some legs. This is a kid, not a baby, and they'll remind you of that regularly.",
    "watchout": "The 3-year well-child visit is a big one, with developmental assessments and vision screening. Keep that appointment. If preschool is coming, your pediatrician can help you gauge readiness. Every child develops on their own timeline, and \"ready for preschool\" looks different for every kid.",
    "cheerup": "Three years. You built this. Every late night, every worry, every decision led to this kid standing in front of you, telling you their name and what they dreamed about last night. Well done."
  }
}
