[
  {
    "id": "wo-9-1",
    "month": 9,
    "title": "Choking hazards",
    "description": "Baby's pincer grasp is developing, meaning they can pick up very small objects. Keep coins, buttons, batteries, small toys, and any item smaller than a toilet paper roll out of reach.",
    "severity": "urgent",
    "action": "Do a daily floor sweep for small objects. Cut food into small pieces (no larger than 1/2 inch). Avoid round, hard foods like whole grapes, hot dogs, and popcorn.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "Children under age 3 are at the highest risk of choking. Any object small enough to fit through a toilet paper roll is a potential choking hazard."
  },
  {
    "id": "wo-9-2",
    "month": 9,
    "title": "Pulling up hazards",
    "description": "Baby is starting to pull up on furniture. Unsecured furniture, tablecloths, and items on table edges become dangerous as baby can pull things down on themselves.",
    "severity": "urgent",
    "action": "Secure heavy furniture to walls with anti-tip anchors. Remove tablecloths. Keep hot drinks and heavy objects away from table edges.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "Tip-over incidents involving furniture and TVs send thousands of children to the emergency room each year. Anchoring furniture to the wall is the most effective prevention."
  },
  {
    "id": "wo-9-3",
    "month": 9,
    "title": "Stranger anxiety is normal",
    "description": "Baby may become very upset around unfamiliar people, even relatives they haven't seen recently. This is a healthy developmental sign, not a behavioral problem.",
    "severity": "info",
    "action": "Give baby time to warm up to new people. Don't force interactions. Let baby observe from your arms before approaching others.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Stranger anxiety is a sign that your baby understands the difference between familiar and unfamiliar people, reflecting healthy emotional and social development."
  },
  {
    "id": "wo-10-1",
    "month": 10,
    "title": "Stair safety",
    "description": "Mobile babies can reach stairs quickly and are at high risk for falls. They can climb up but cannot safely come back down.",
    "severity": "urgent",
    "action": "Install safety gates at the top and bottom of all staircases. Teach baby to go down stairs safely by backing down feet first.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "Falls are the leading cause of injury for young children. Safety gates at the top and bottom of stairs are essential once babies begin to crawl and cruise."
  },
  {
    "id": "wo-10-2",
    "month": 10,
    "title": "Electrical outlet danger",
    "description": "Crawling babies are at the perfect height to explore electrical outlets. They may try to stick fingers or objects into them.",
    "severity": "urgent",
    "action": "Cover all accessible electrical outlets with outlet covers or plates. Keep cords out of reach and secured.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "Electrical outlets should be covered with safety caps or tamper-resistant receptacles to prevent children from inserting objects that could cause shock or burns."
  },
  {
    "id": "wo-10-3",
    "month": 10,
    "title": "Separation anxiety peak",
    "description": "Separation anxiety typically peaks between 10-18 months. Baby may become extremely clingy and distressed when you leave the room.",
    "severity": "info",
    "action": "Create consistent goodbye rituals. Keep separations brief at first and gradually extend. Always say goodbye rather than sneaking away.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Separation anxiety shows that your child has formed a strong, healthy attachment. Consistent and reassuring goodbye routines help children learn that you always come back."
  },
  {
    "id": "wo-11-1",
    "month": 11,
    "title": "Cabinet and drawer safety",
    "description": "Baby can now open cabinets and drawers, accessing cleaning supplies, medications, sharp objects, and other hazards.",
    "severity": "urgent",
    "action": "Install child-proof locks on all cabinets containing hazardous items. Move cleaning supplies and medications to high shelves. Lock the medicine cabinet.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "Household cleaning products and medications should be stored in locked cabinets out of children's reach. Child-resistant packaging is not child-proof."
  },
  {
    "id": "wo-11-2",
    "month": 11,
    "title": "Walking readiness varies",
    "description": "Some babies walk at 9 months, others at 15+ months. Both are normal. Don't pressure baby to walk before they're ready.",
    "severity": "info",
    "action": "Avoid walkers (they can delay walking and cause injuries). Let baby cruise, stand, and step at their own pace. Consult your pediatrician if baby isn't walking by 18 months.",
    "source": "AAP",
    "sourceUrl": "https://www.healthychildren.org/English/ages-stages/baby/Pages/Developmental-Milestones.aspx",
    "sourceQuote": "The AAP advises against infant walkers, as they can cause injuries and may delay motor development. Children develop walking skills on their own timeline."
  },
  {
    "id": "wo-11-3",
    "month": 11,
    "title": "Bath safety",
    "description": "Babies can drown in as little as 1 inch of water. They can also slip and hit their head on hard tub surfaces.",
    "severity": "urgent",
    "action": "Never leave baby alone in the bath, even for a moment. Use a non-slip mat. Keep water temperature below 100F (38C). Always test water before placing baby in.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "A child can drown in just one inch of water. Never leave a young child unattended in or near any body of water, including bathtubs, even for a moment."
  },
  {
    "id": "wo-12-1",
    "month": 12,
    "title": "Transitioning from bottle to cup",
    "description": "The AAP recommends weaning from bottles by 12-15 months. Prolonged bottle use can affect dental development and increase risk of tooth decay.",
    "severity": "caution",
    "action": "Start offering milk in a sippy cup or open cup. Gradually reduce bottle feedings, eliminating the bedtime bottle last.",
    "source": "AAP",
    "sourceUrl": "https://www.healthychildren.org/English/ages-stages/baby/Pages/Developmental-Milestones.aspx",
    "sourceQuote": "Pediatricians recommend weaning from the bottle by 12 to 15 months of age, as prolonged bottle use is associated with dental cavities and excess calorie intake."
  },
  {
    "id": "wo-12-2",
    "month": 12,
    "title": "Whole milk transition",
    "description": "At 12 months, baby can transition to whole cow's milk. However, too much milk can displace solid food intake and lead to iron deficiency.",
    "severity": "caution",
    "action": "Limit whole milk to 16-24 oz per day. Ensure baby is eating a variety of iron-rich foods. Continue offering water throughout the day.",
    "source": "AAP",
    "sourceUrl": "https://www.healthychildren.org/English/ages-stages/baby/Pages/Developmental-Milestones.aspx",
    "sourceQuote": "After 12 months, children can begin drinking whole cow's milk, but intake should be limited to 16-24 ounces per day to ensure adequate iron and nutrient intake from solid foods."
  },
  {
    "id": "wo-12-3",
    "month": 12,
    "title": "Head injuries from early walking",
    "description": "New walkers fall frequently and can hit their heads on hard surfaces, furniture corners, and sharp edges.",
    "severity": "caution",
    "action": "Pad sharp furniture corners. Keep floors clear of tripping hazards. Monitor closely but allow reasonable exploration. Know the signs of concussion.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Falls are the most common cause of injury in children learning to walk. Padding sharp corners and clearing floors of obstacles can reduce the risk of head injuries."
  },
  {
    "id": "wo-13-1",
    "month": 13,
    "title": "Picky eating may begin",
    "description": "Many toddlers become more selective about food around this age. Food jags (wanting only one food) and refusing previously accepted foods are common.",
    "severity": "info",
    "action": "Continue offering a variety of foods without pressure. It can take 10-15 exposures before a child accepts a new food. Don't make separate meals.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Picky eating is a normal part of toddler development as children assert independence. Repeated, pressure-free exposure to new foods is the best approach to expanding their diet."
  },
  {
    "id": "wo-13-2",
    "month": 13,
    "title": "Climbing furniture risks",
    "description": "Toddlers who can walk start climbing on everything. Bookshelves, dressers, and TVs are serious tip-over hazards.",
    "severity": "urgent",
    "action": "Anchor all tall furniture and TVs to the wall. Remove items that encourage climbing near windows or on high surfaces.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "A child dies every two weeks from furniture or TV tip-overs. The CPSC urges all families to anchor furniture and TVs to the wall to prevent these preventable tragedies."
  },
  {
    "id": "wo-14-1",
    "month": 14,
    "title": "Window and balcony safety",
    "description": "Mobile toddlers can climb to windows and are at risk for falls. Window screens are not strong enough to prevent falls.",
    "severity": "urgent",
    "action": "Install window guards or stops that prevent windows from opening more than 4 inches. Keep furniture away from windows. Supervise on balconies.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "Window screens are designed to keep insects out, not to prevent children from falling. Install window guards or stops to limit openings to 4 inches or less."
  },
  {
    "id": "wo-14-2",
    "month": 14,
    "title": "Language development monitoring",
    "description": "By 14 months, baby should be using a few words and understanding simple commands. Significant delays may warrant evaluation.",
    "severity": "caution",
    "action": "Talk and read to baby frequently. If baby uses no words and doesn't seem to understand simple phrases, discuss with your pediatrician at the next visit.",
    "source": "CDC Act Early",
    "sourceUrl": "https://www.cdc.gov/act-early/milestones/index.html",
    "sourceQuote": "Monitoring your child's developmental milestones helps catch concerns early. If your child is not meeting communication milestones, early intervention can make a meaningful difference."
  },
  {
    "id": "wo-15-1",
    "month": 15,
    "title": "15-month well-child visit",
    "description": "The 15-month checkup includes important vaccinations and developmental screening. Don't skip this appointment.",
    "severity": "caution",
    "action": "Schedule the 15-month well-child visit. Prepare a list of developmental concerns or questions. Bring your baby's health records.",
    "source": "AAP",
    "sourceUrl": "https://www.healthychildren.org/English/ages-stages/baby/Pages/Developmental-Milestones.aspx",
    "sourceQuote": "Well-child visits are essential for tracking growth, development, and administering recommended vaccinations on schedule to protect your child's health."
  },
  {
    "id": "wo-15-2",
    "month": 15,
    "title": "Tantrums may start",
    "description": "Toddlers understand more than they can express, leading to frustration. Early tantrums often appear around 15-18 months.",
    "severity": "info",
    "action": "Stay calm during tantrums. Acknowledge feelings: 'I know you're frustrated.' Offer simple choices to give some control. Ensure safety during the tantrum.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Tantrums are a normal part of development when toddlers' desire to do things outpaces their ability to communicate. Staying calm and validating feelings helps children learn to manage emotions."
  },
  {
    "id": "wo-15-3",
    "month": 15,
    "title": "Dental care",
    "description": "Baby should have their first dental visit by age 1 or within 6 months of the first tooth. Early dental care prevents future problems.",
    "severity": "caution",
    "action": "Schedule a dental visit if not done yet. Brush teeth twice daily with a rice-grain-sized amount of fluoride toothpaste. Avoid juice and sugary drinks.",
    "source": "AAP",
    "sourceUrl": "https://www.healthychildren.org/English/ages-stages/baby/Pages/Developmental-Milestones.aspx",
    "sourceQuote": "The AAP recommends a child's first dental visit by age 1 or within 6 months of the first tooth. Early preventive dental care reduces the risk of cavities and future dental problems."
  },
  {
    "id": "wo-16-1",
    "month": 16,
    "title": "Toddler-proofing the kitchen",
    "description": "Toddlers are increasingly mobile and curious. The kitchen contains hot surfaces, sharp objects, and chemicals within climbing reach.",
    "severity": "caution",
    "action": "Use stove knob covers and back burners. Turn pot handles inward. Store knives and chemicals up high. Keep toddler away from the stove when cooking.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Burns from hot liquids and contact with stoves are among the most common kitchen injuries in young children. Using back burners and turning pot handles inward are simple, effective precautions."
  },
  {
    "id": "wo-16-2",
    "month": 16,
    "title": "Screen time limits",
    "description": "The AAP recommends avoiding screen time (except video chatting) for children under 18 months. Excessive screen time can affect language development.",
    "severity": "caution",
    "action": "Limit or avoid screen time. If using screens, watch together and talk about what you see. Prioritize interactive play, reading, and outdoor time.",
    "source": "AAP",
    "sourceUrl": "https://www.healthychildren.org/English/ages-stages/baby/Pages/Developmental-Milestones.aspx",
    "sourceQuote": "The AAP recommends avoiding digital media use, except video chatting, for children younger than 18 months, as interactive play better supports language and cognitive development."
  },
  {
    "id": "wo-17-1",
    "month": 17,
    "title": "Climbing out of crib",
    "description": "Some toddlers start climbing out of their crib around this age, creating a fall risk.",
    "severity": "caution",
    "action": "Lower the mattress to its lowest position. Remove bumpers, toys, and pillows that could be used as stepping stones. If climbing persists, consider transitioning to a toddler bed.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "Set the crib mattress to the lowest position as soon as your child can pull to stand. Remove any objects from the crib that could be used as a step for climbing out."
  },
  {
    "id": "wo-17-2",
    "month": 17,
    "title": "Throwing objects",
    "description": "Toddlers love to throw things as part of learning cause and effect. This can lead to broken items or injuries.",
    "severity": "info",
    "action": "Provide safe throwing opportunities with soft balls. Redirect throwing of hard or dangerous objects. Say 'Balls are for throwing, blocks are not.'",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Throwing is how toddlers explore cause and effect and develop motor skills. Providing appropriate outlets for throwing helps channel this behavior constructively."
  },
  {
    "id": "wo-18-1",
    "month": 18,
    "title": "18-month developmental screening",
    "description": "The AAP recommends autism screening at 18 months. This is a critical checkpoint for identifying developmental concerns early.",
    "severity": "caution",
    "action": "Attend the 18-month well-child visit. Complete any screening questionnaires your pediatrician provides. Discuss any concerns about social interaction, communication, or repetitive behaviors.",
    "source": "CDC Act Early",
    "sourceUrl": "https://www.cdc.gov/act-early/milestones/index.html",
    "sourceQuote": "The AAP recommends developmental screening at 9, 18, and 30 months, and autism-specific screening at 18 months. Early identification leads to earlier access to services that improve outcomes."
  },
  {
    "id": "wo-18-2",
    "month": 18,
    "title": "Biting and hitting",
    "description": "Toddlers may bite, hit, or push when frustrated, angry, or overwhelmed. This is common but needs consistent, calm guidance.",
    "severity": "info",
    "action": "Stay calm. Say 'No biting. Biting hurts.' Comfort the other child first. Help toddler use words for feelings. Never bite back as punishment.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Biting and hitting are common in toddlers who lack the language to express strong feelings. Responding calmly and consistently helps children gradually develop self-control."
  },
  {
    "id": "wo-18-3",
    "month": 18,
    "title": "Car seat safety check",
    "description": "Ensure your child is still rear-facing in their car seat. The AAP recommends rear-facing until at least age 2 or until they exceed the car seat's weight/height limit.",
    "severity": "caution",
    "action": "Keep car seat rear-facing. Check that the harness fits snugly. Verify the seat is installed correctly. Never use a car seat that has been in an accident.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Children should ride in a rear-facing car seat as long as possible, until they reach the maximum height or weight allowed by the seat. Rear-facing provides the best protection for a child's head, neck, and spine."
  },
  {
    "id": "wo-19-1",
    "month": 19,
    "title": "Running into danger",
    "description": "Newly mobile runners may dash toward streets, parking lots, or other dangerous areas without awareness of danger.",
    "severity": "urgent",
    "action": "Hold hands in parking lots and near streets. Teach 'stop' as a safety command. Practice listening to 'freeze' and 'wait.' Never let toddler walk unattended near traffic.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Young children have no concept of traffic safety and may dart into the street without warning. Always hold a child's hand in or near roadways and parking areas."
  },
  {
    "id": "wo-19-2",
    "month": 19,
    "title": "Sleep regression",
    "description": "Many toddlers experience a sleep regression around 18-21 months, with resistance to bedtime, night wakings, or early morning waking.",
    "severity": "info",
    "action": "Maintain a consistent bedtime routine. Keep the same sleep schedule. Be patient; most regressions pass in 2-6 weeks. Avoid introducing new sleep crutches.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Sleep disruptions are common during periods of rapid development. Maintaining a consistent, calming bedtime routine helps toddlers settle back into healthy sleep patterns."
  },
  {
    "id": "wo-20-1",
    "month": 20,
    "title": "Water safety",
    "description": "Toddlers are attracted to water but have no awareness of drowning danger. Pools, bathtubs, buckets, and even toilets are hazards.",
    "severity": "urgent",
    "action": "Never leave toddler unattended near any water. Empty buckets and wading pools after use. Install pool fences with self-closing gates. Keep toilet lids locked.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Drowning is the leading cause of death for children ages 1 to 4. Constant adult supervision and barriers like pool fencing are the most effective ways to prevent drowning."
  },
  {
    "id": "wo-20-2",
    "month": 20,
    "title": "Defiance is developmental",
    "description": "Saying 'no' to everything and testing boundaries is a normal, healthy part of developing autonomy. It's not misbehavior.",
    "severity": "info",
    "action": "Offer limited choices instead of yes/no questions. Pick your battles. Stay calm and consistent with important boundaries. Praise cooperation when it happens.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Toddlers say 'no' as a way of asserting their growing sense of self. Offering limited choices gives them a healthy sense of control while keeping them safe."
  },
  {
    "id": "wo-21-1",
    "month": 21,
    "title": "Playground safety",
    "description": "Toddlers are climbing higher and trying new things on playground equipment. Falls from heights are a common source of injuries.",
    "severity": "caution",
    "action": "Stay within arm's reach on playground equipment. Choose age-appropriate equipment. Check that the ground surface is soft (mulch, rubber). Avoid equipment taller than 4 feet.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Most playground injuries are caused by falls. Using age-appropriate equipment with proper safety surfacing underneath significantly reduces the risk of serious injury."
  },
  {
    "id": "wo-21-2",
    "month": 21,
    "title": "Tooth brushing battles",
    "description": "Many toddlers resist tooth brushing. However, dental hygiene is critical, especially as more teeth come in.",
    "severity": "caution",
    "action": "Make brushing fun with songs or games. Let toddler hold their own brush while you do the actual brushing. Use a timer or fun app. Brush twice daily.",
    "source": "AAP",
    "sourceUrl": "https://www.healthychildren.org/English/ages-stages/baby/Pages/Developmental-Milestones.aspx",
    "sourceQuote": "Parents should brush their child's teeth twice daily using a smear of fluoride toothpaste. Good oral hygiene habits established early help prevent cavities throughout childhood."
  },
  {
    "id": "wo-22-1",
    "month": 22,
    "title": "Emotional outbursts increasing",
    "description": "Peak tantrum age is typically 18-24 months. Toddler has big emotions and limited ability to regulate or communicate them.",
    "severity": "info",
    "action": "Validate emotions: 'You're really angry right now.' Stay nearby but calm. Don't give in to demands made during tantrums. Teach simple emotion words.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Toddlers experience intense emotions but are still developing the brain pathways needed for self-regulation. Naming feelings and staying calm teaches them to manage emotions over time."
  },
  {
    "id": "wo-22-2",
    "month": 22,
    "title": "Poisoning prevention",
    "description": "Curious toddlers can access cleaning products, medications, and plants. Poisoning is a leading cause of injury for children under 5.",
    "severity": "urgent",
    "action": "Store all medications and cleaning products locked and out of reach. Keep Poison Control number saved: 1-800-222-1222. Know which houseplants are toxic.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "Over 2 million poisoning cases involving children under 6 are reported each year. Store all household chemicals and medicines in locked cabinets out of children's sight and reach."
  },
  {
    "id": "wo-23-1",
    "month": 23,
    "title": "Potty training readiness",
    "description": "Some toddlers show signs of potty readiness around 2 years old. Starting too early can create frustration for both parent and child.",
    "severity": "info",
    "action": "Look for readiness signs: staying dry for 2+ hours, interest in the toilet, telling you about wet/dirty diapers. Don't force it; follow child's lead.",
    "source": "AAP",
    "sourceUrl": "https://www.healthychildren.org/English/ages-stages/baby/Pages/Developmental-Milestones.aspx",
    "sourceQuote": "Most children show signs of readiness for toilet training between 18 and 24 months. Following the child's cues rather than a strict timeline leads to more successful outcomes."
  },
  {
    "id": "wo-23-2",
    "month": 23,
    "title": "Rope and cord hazards",
    "description": "Toddlers may play with cords from blinds, curtains, or charging cables, creating strangulation risk.",
    "severity": "urgent",
    "action": "Replace corded blinds with cordless ones. Keep all cords and strings out of reach. Tie up curtain cords and charging cables. Remove necklaces and long strings from toys.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "Window blind cords are among the top hidden hazards in homes. The CPSC recommends using only cordless window coverings in homes with young children to prevent strangulation."
  },
  {
    "id": "wo-24-1",
    "month": 24,
    "title": "2-year well-child visit",
    "description": "The 2-year checkup includes a second autism screening, developmental assessment, and health review. This is an important milestone visit.",
    "severity": "caution",
    "action": "Schedule the 2-year well-child visit. Note developmental milestones reached and any concerns. Bring questions about behavior, sleep, eating, and development.",
    "source": "CDC Act Early",
    "sourceUrl": "https://www.cdc.gov/act-early/milestones/index.html",
    "sourceQuote": "The CDC recommends developmental screening at the 2-year well-child visit, including a second autism-specific screening. Tracking milestones helps identify concerns when early intervention is most effective."
  },
  {
    "id": "wo-24-2",
    "month": 24,
    "title": "Turning car seat forward-facing",
    "description": "At age 2, many parents consider turning the car seat forward-facing. However, rear-facing is still safer as long as the child meets weight/height limits.",
    "severity": "caution",
    "action": "Keep rear-facing as long as possible within the car seat's limits. When switching to forward-facing, ensure the harness is properly positioned at or above shoulders.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "The AAP recommends keeping children rear-facing as long as possible, up to the maximum height and weight limits of the car seat. Rear-facing seats provide superior crash protection."
  },
  {
    "id": "wo-24-3",
    "month": 24,
    "title": "Aggressive behavior with peers",
    "description": "Toddlers at this age may push, grab, or hit other children. They're still learning social skills and impulse control.",
    "severity": "info",
    "action": "Supervise play closely. Intervene calmly and quickly. Model gentle behavior. Use simple words: 'Gentle hands.' Remove child briefly if behavior continues.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Aggressive behavior in toddlers reflects their still-developing impulse control and limited social skills. Calm, consistent guidance helps children gradually learn to interact with peers."
  },
  {
    "id": "wo-25-1",
    "month": 25,
    "title": "Toddler bed transition safety",
    "description": "If transitioning from crib to toddler bed, the entire room must be child-proofed since toddler can roam freely.",
    "severity": "caution",
    "action": "Secure furniture to walls. Cover outlets. Remove choking hazards. Install a gate at the bedroom door or top of stairs. Use a bed rail to prevent rolling out.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "When transitioning to a toddler bed, the entire room becomes the child's sleep environment. Anchor furniture, cover outlets, and use safety gates to keep the space safe."
  },
  {
    "id": "wo-25-2",
    "month": 25,
    "title": "Sun safety",
    "description": "Toddlers spending more time outdoors need sun protection. Their skin is more sensitive to UV damage than adults.",
    "severity": "caution",
    "action": "Apply SPF 30+ sunscreen 15 minutes before going outside. Reapply every 2 hours. Use hats and UV-protective clothing. Seek shade during peak hours (10am-2pm).",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Children's skin is more vulnerable to sun damage than adults'. The AAP recommends broad-spectrum SPF 30+ sunscreen, protective clothing, and seeking shade during peak UV hours."
  },
  {
    "id": "wo-26-1",
    "month": 26,
    "title": "Nightmares may begin",
    "description": "Some toddlers start having nightmares around this age. They may wake up crying and be scared of the dark or monsters.",
    "severity": "info",
    "action": "Comfort and reassure your child. Use a nightlight if darkness is scary. Avoid scary content before bed. Maintain a calming bedtime routine.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Nightmares can begin as a child's imagination develops. Comforting your child and maintaining a predictable bedtime routine helps them feel safe and secure at night."
  },
  {
    "id": "wo-26-2",
    "month": 26,
    "title": "Driveway and garage safety",
    "description": "Toddlers are hard to see behind vehicles. Driveway backover accidents are a serious risk.",
    "severity": "urgent",
    "action": "Always know where your toddler is before moving a vehicle. Walk around the car before backing up. Hold toddler's hand in driveways. Keep garage doors closed.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Young children are especially at risk for backover injuries because they are small and difficult to see behind vehicles. Always check behind your car before moving it."
  },
  {
    "id": "wo-27-1",
    "month": 27,
    "title": "Dog and pet safety",
    "description": "Toddlers may not understand gentle touch with pets. Even family pets can bite when startled, hurt, or resource-guarding.",
    "severity": "caution",
    "action": "Never leave toddler unsupervised with any pet. Teach gentle petting. Keep toddler away from pets that are eating. Learn to read pet stress signals.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Most dog bites to children come from a familiar dog, often the family pet. Children should always be supervised around animals and taught to interact gently."
  },
  {
    "id": "wo-27-2",
    "month": 27,
    "title": "Refusing vegetables is normal",
    "description": "Many toddlers go through a phase of rejecting vegetables. This is biologically normal as toddlers become more cautious of bitter tastes.",
    "severity": "info",
    "action": "Keep offering vegetables without pressure. Serve them alongside accepted foods. Try different preparations (roasted, pureed, raw with dip). Model eating vegetables yourself.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Toddlers are naturally cautious about new and bitter-tasting foods as a protective instinct. Research shows that repeated, no-pressure exposure is the most effective way to broaden food acceptance."
  },
  {
    "id": "wo-28-1",
    "month": 28,
    "title": "Scissor safety",
    "description": "If introducing child-safe scissors, toddlers may try to cut things that aren't paper: hair, clothing, or fingers.",
    "severity": "caution",
    "action": "Only allow scissors during supervised activities. Use child-safe scissors with rounded tips. Teach that scissors are only for paper. Store out of reach when not in use.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "When introducing scissors, always supervise closely and use child-safe scissors with blunt tips. Teaching proper use early helps build fine motor skills while preventing injuries."
  },
  {
    "id": "wo-28-2",
    "month": 28,
    "title": "Stuttering may appear",
    "description": "It's common for toddlers to stutter or repeat words as their language develops rapidly. Most developmental stuttering resolves on its own.",
    "severity": "info",
    "action": "Don't draw attention to the stuttering. Maintain eye contact and wait patiently. Don't finish their sentences. Speak slowly yourself. If it persists past 6 months, consult a speech-language pathologist.",
    "source": "AAP",
    "sourceUrl": "https://www.healthychildren.org/English/ages-stages/baby/Pages/Developmental-Milestones.aspx",
    "sourceQuote": "Developmental stuttering is common between ages 2 and 5 as children's language skills are rapidly expanding. Most children outgrow it naturally without intervention."
  },
  {
    "id": "wo-29-1",
    "month": 29,
    "title": "Running and falling risks",
    "description": "Toddlers are running faster but still developing coordination. Falls on hard surfaces, stairs, and uneven ground are common.",
    "severity": "caution",
    "action": "Ensure outdoor play areas have soft surfaces. Keep pathways clear of tripping hazards. Have toddler wear supportive shoes with non-slip soles.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Unintentional falls are the leading cause of non-fatal injuries in young children. Safe footwear and clear play areas help reduce the risk as toddlers develop coordination."
  },
  {
    "id": "wo-29-2",
    "month": 29,
    "title": "Imaginary fears",
    "description": "As imagination develops, toddlers may develop fears of the dark, monsters, loud noises, or unfamiliar situations.",
    "severity": "info",
    "action": "Take fears seriously even if they seem irrational. Use a nightlight. Read books about overcoming fears. Avoid forcing child into scary situations. Offer comfort and reassurance.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Emerging fears are a sign of a growing imagination and developing cognitive abilities. Taking a child's fears seriously and offering comfort helps build their sense of security."
  },
  {
    "id": "wo-30-1",
    "month": 30,
    "title": "30-month developmental check",
    "description": "Some pediatricians schedule a 30-month visit. Even without a formal visit, this is a good time to check developmental milestones.",
    "severity": "caution",
    "action": "Review CDC developmental milestones for 30 months. Contact your pediatrician if toddler doesn't use 2-word phrases, doesn't know what to do with familiar objects, or doesn't copy actions and words.",
    "source": "CDC Act Early",
    "sourceUrl": "https://www.cdc.gov/act-early/milestones/index.html",
    "sourceQuote": "Developmental monitoring at 30 months helps identify children who may benefit from early intervention services. Tracking milestones at home between visits is an important part of your child's care."
  },
  {
    "id": "wo-30-2",
    "month": 30,
    "title": "Button battery danger",
    "description": "Button batteries are found in many household items (remotes, toys, watches). If swallowed, they can cause severe internal burns within 2 hours.",
    "severity": "urgent",
    "action": "Secure all battery compartments with tape or screws. Keep loose batteries locked away. If swallowing is suspected, go to the ER immediately. Do not induce vomiting.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "Button batteries can cause serious injury or death if swallowed. A swallowed battery can burn through a child's esophagus in as little as two hours. Seek emergency care immediately."
  },
  {
    "id": "wo-31-1",
    "month": 31,
    "title": "Potty training pressure",
    "description": "If potty training is underway, avoid putting too much pressure on the child. Stress and pressure can lead to resistance and setbacks.",
    "severity": "info",
    "action": "Celebrate successes without over-praising. Don't punish accidents. Be patient with regression. Avoid asking 'Do you need to go potty?' constantly.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Toilet learning works best when children feel in control of the process. Pressure and punishment can create anxiety and lead to resistance, prolonging the process."
  },
  {
    "id": "wo-31-2",
    "month": 31,
    "title": "Medication safety",
    "description": "Toddlers can now open child-resistant (not child-proof) containers. Medication poisoning remains a top risk for this age group.",
    "severity": "urgent",
    "action": "Store all medications locked and out of reach. Never call medicine 'candy.' Dispose of unused medications safely. Program Poison Control (1-800-222-1222) into your phone.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "Child-resistant packaging is not child-proof. More than 60,000 children are seen in emergency rooms each year due to unsupervised access to medicines. Always store medications locked and out of reach."
  },
  {
    "id": "wo-32-1",
    "month": 32,
    "title": "New sibling jealousy",
    "description": "If a new sibling arrives around this time, toddlers may regress in behavior (wanting a bottle, having accidents after being potty trained) or act out.",
    "severity": "info",
    "action": "Give toddler special one-on-one time daily. Let them 'help' with the baby. Avoid major changes (new bed, potty training) right around the birth. Be patient with regression.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Regression and jealousy when a new sibling arrives are normal reactions to a big life change. One-on-one time and involvement in baby care help toddlers adjust."
  },
  {
    "id": "wo-32-2",
    "month": 32,
    "title": "Furniture climbing escalation",
    "description": "Toddlers become more capable climbers. Kitchen counters, bathroom sinks, and high shelves become accessible, putting them near sharp objects, medicines, and hot items.",
    "severity": "caution",
    "action": "Remove step stools and chairs that enable climbing to dangerous areas. Keep knives, scissors, and hazardous items in locked or high cabinets. Install stove guards.",
    "source": "CPSC",
    "sourceUrl": "https://www.cpsc.gov/Safety-Education/Safety-Guides/Kids-and-Babies",
    "sourceQuote": "As children grow more skilled at climbing, reassess your home for new hazards they can reach. Move dangerous items higher and remove furniture that serves as stepping stones."
  },
  {
    "id": "wo-33-1",
    "month": 33,
    "title": "Preschool readiness",
    "description": "If considering preschool, many programs start accepting children at age 3. Separation anxiety may resurface when starting a new environment.",
    "severity": "info",
    "action": "Visit potential preschools together. Start with short trial visits. Read books about school. Create a consistent drop-off routine. Give it 2-4 weeks for adjustment.",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Transitions to new settings can be challenging for young children. Gradual introductions, consistent routines, and reading about the experience beforehand help ease the adjustment."
  },
  {
    "id": "wo-33-2",
    "month": 33,
    "title": "Frequent illness exposure",
    "description": "If in daycare or starting preschool, toddlers may get sick frequently (6-8 colds per year is normal). Their immune system is still developing.",
    "severity": "info",
    "action": "Teach hand washing. Keep child home when running a fever. Ensure vaccinations are up to date. Consult your doctor about concerning symptoms, not just frequency of colds.",
    "source": "AAP",
    "sourceUrl": "https://www.healthychildren.org/English/ages-stages/baby/Pages/Developmental-Milestones.aspx",
    "sourceQuote": "It is normal for young children in group settings to get 6 to 8 colds per year. Frequent handwashing and staying current on vaccinations are the best ways to reduce illness."
  },
  {
    "id": "wo-34-1",
    "month": 34,
    "title": "Wandering and elopement",
    "description": "Toddlers who can open doors may wander outside unsupervised. This is extremely dangerous near roads, pools, or other hazards.",
    "severity": "urgent",
    "action": "Install child-proof door handle covers or high deadbolts. Consider door alarms. Teach your address and phone number. Ensure yard is fenced. Always supervise outdoor play.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Children who can reach and open doors can wander into dangerous situations quickly. Door locks, alarms, and fenced yards provide critical layers of protection."
  },
  {
    "id": "wo-34-2",
    "month": 34,
    "title": "Speech clarity expectations",
    "description": "By this age, strangers should understand about 75% of what your child says. If speech is very unclear, it may be worth evaluating.",
    "severity": "caution",
    "action": "If strangers can't understand most of what your child says, or if child is very frustrated trying to communicate, ask your pediatrician about a speech evaluation.",
    "source": "CDC Act Early",
    "sourceUrl": "https://www.cdc.gov/act-early/milestones/index.html",
    "sourceQuote": "By age 3, most of what a child says should be understandable to people outside the family. If speech is very difficult to understand, a speech-language evaluation may be helpful."
  },
  {
    "id": "wo-35-1",
    "month": 35,
    "title": "Preparing for the 3-year visit",
    "description": "The 3-year well-child visit includes a comprehensive developmental assessment, vision and hearing screening, and vaccination review.",
    "severity": "caution",
    "action": "Schedule the 3-year checkup. Track developmental milestones. Prepare questions about behavior, sleep, diet, and social development.",
    "source": "AAP",
    "sourceUrl": "https://www.healthychildren.org/English/ages-stages/baby/Pages/Developmental-Milestones.aspx",
    "sourceQuote": "The 3-year well-child visit is a key checkpoint that includes vision and hearing screening, developmental assessment, and a review of your child's overall health and growth."
  },
  {
    "id": "wo-35-2",
    "month": 35,
    "title": "Playground injuries",
    "description": "As children become more confident, they attempt more challenging playground activities. Falls from monkey bars, slides, and climbing structures are common.",
    "severity": "caution",
    "action": "Supervise closely at playgrounds. Ensure equipment is age-appropriate. Check for proper safety surfacing under equipment. Teach children to wait their turn.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "More than 200,000 children are treated in emergency rooms for playground injuries each year. Active supervision and age-appropriate equipment are key to safe outdoor play."
  },
  {
    "id": "wo-36-1",
    "month": 36,
    "title": "3-year developmental milestones review",
    "description": "By age 3, child should be speaking in 3+ word sentences, playing with other children, following 2-3 step instructions, and running well. Notable gaps may warrant evaluation.",
    "severity": "caution",
    "action": "Review CDC milestones for 3 years. Discuss any concerns with your pediatrician. Early intervention services are most effective when started early.",
    "source": "CDC Act Early",
    "sourceUrl": "https://www.cdc.gov/act-early/milestones/index.html",
    "sourceQuote": "Research shows that early identification and intervention for developmental delays lead to better outcomes. If your child is not meeting key milestones by age 3, talk to your pediatrician."
  },
  {
    "id": "wo-36-2",
    "month": 36,
    "title": "Booster seat transition",
    "description": "Children should remain in a forward-facing car seat with harness as long as possible (typically until age 4-5 or max weight). Don't rush to a booster seat.",
    "severity": "caution",
    "action": "Keep child in a harnessed forward-facing car seat. Don't switch to a booster seat yet. Verify your car seat's weight and height limits.",
    "source": "AAP (HealthyChildren.org)",
    "sourceUrl": "https://www.healthychildren.org/English/safety-prevention/Pages/default.aspx",
    "sourceQuote": "Children should ride in a forward-facing car seat with a harness for as long as possible, until they reach the seat's maximum height or weight. A harnessed seat provides better crash protection than a booster."
  },
  {
    "id": "wo-36-3",
    "month": 36,
    "title": "Setting consistent boundaries",
    "description": "By age 3, children test boundaries constantly. Inconsistent rules cause confusion and can increase challenging behavior.",
    "severity": "info",
    "action": "Agree on rules with all caregivers. Be consistent in enforcement. Use natural consequences when possible. Explain rules simply: 'We hold hands in the parking lot because cars can hurt us.'",
    "source": "Zero to Three",
    "sourceUrl": "https://www.zerotothree.org/resource/your-childs-development-age-based-tips-from-birth-to-36-months/",
    "sourceQuote": "Consistent, clear boundaries help children feel safe and learn self-discipline. When all caregivers follow the same rules, children are less confused and more cooperative."
  }
]
